siredmar/master/Recherche/EA313x/lpc3xxx_cdl/csps/lpc313x/source/lpc313x_i2c_driver.c
  device = ((I2C_CFG_T *) devid);
  setup  = (I2C_MRX_SETUP_T*)(device->txrx_setup);

  /* were there Arbitration or ACK problems? */
  if ((device->regptr->sts & (I2C_STS_NAI | I2C_STS_AFI)) != 0)
  {
    if (setup->retransmissions_count != setup->retransmissions_max)
    {
      /* update status */
      setup->retransmissions_count++;
      setup->status = setup->retransmissions_count;
      /* clear Arbitration and Transaction Done interrupt flags */
      device->regptr->sts = I2C_STS_AFI | I2C_STS_TDI;
      /* clear received byte counter */
      setup->rx_count = 0;
      /* set transmitted byte counter */
      setup->tx_count = 1;
      /* soft reset */
      device->regptr->ctl = I2C_CTL_SOFT_RESET;
      /* self cleared */
      while (device->regptr->ctl & I2C_CTL_SOFT_RESET);

      /* load slave address */
      load_slave_address(devid, setup->addr_mode,
                         setup->sl_addr, I2C_M_WRITE);
      /* en RxD Av,RxFIFO Fl,M Tx DataR,Tx noACK,Tx ArbF,Tx Done Ints */
      /* write a dummy byte to trigger actual data transfer */
      if (setup->rx_length == setup->tx_count)
      {
        /* If rx_length is 1, dummy + STOP on TX FIFO */
        device->regptr->fifo = I2C_TXFF_STOP_CND | 0xAA;
      }
      else
      {
        device->regptr->fifo = 0xAA;
      }
      device->regptr->ctl = I2C_CTL_DAIE | I2C_CTL_RFFIE | I2C_CTL_DRMIE |
                            I2C_CTL_NAIE | I2C_CTL_AFIE | I2C_CTL_TDIE;
    }
    else
    {
      /* update status */
      setup->status |=
        ((device->regptr->sts & ((I2C_STS_AFI | I2C_STS_NAI)) << 8) |
         I2C_SETUP_STATUS_DONE);
      /* Disable I2C interrupt in the interrupt controller */
      disable_i2c_irq_int(devid);
    }
  }
  /* was a STOP generated? */
  else if ((device->regptr->sts & I2C_STS_TDI) != 0)
  {
    /* clear the TDI bit */
    device->regptr->sts |= I2C_STS_TDI;
    /* update status */
    setup->status |= I2C_SETUP_STATUS_DONE;
    /* Disable I2C interrupt in the interrupt controller */
    disable_i2c_irq_int(devid);
  }
  /* read more data */
  else
  {
    length  = setup->rx_length;
    count   = setup->rx_count;
    while ((length != count) &&
           ((device->regptr->sts & I2C_STS_RFE) == 0))
    {
      (setup->rx_data)[count] = device->regptr->fifo;
      count++;
    }
    setup->rx_count = count;
    /* have all data been received? */
    if (count == length)
    {
      /* enable Tx no ACK, Tx Arbitr Fail, Tx Done Ints */
      device->regptr->ctl = I2C_CTL_NAIE | I2C_CTL_AFIE | I2C_CTL_TDIE;
    }
    else
    {
      // not all data received, fill the Tx FIFO with more dummies
      while ((setup->tx_count != length) &&
             ((device->regptr->sts & I2C_STS_TFF) == 0))
      {
        if (((setup->tx_count) + 1) == length)
        {
          device->regptr->fifo = I2C_TXFF_STOP_CND | 0xAA;
        }
        else
        {
          device->regptr->fifo = 0xAA;
        }
        setup->tx_count++;
      }
    }
  }
  return;
}

/***********************************************************************
 * I2C master transmitter followed by master receiver interrupt handler
 **********************************************************************/
void i2c_mtxrx_handler(INT_32 devid)
{
  UNS_32 length, count;
  I2C_CFG_T * device;
  I2C_MTXRX_SETUP_T * setup;
  static UNS_32 txrx_state = 0;

  device = ((I2C_CFG_T *) devid);
  setup  = (I2C_MTXRX_SETUP_T*)(device->txrx_setup);

  /* were there Arbitration or ACK problems? */
  if ((device->regptr->sts & (I2C_STS_NAI | I2C_STS_AFI)) != 0)
  {
    if (setup->retransmissions_count != setup->retransmissions_max)
    {
      /* update status */
      setup->retransmissions_count++;
      setup->status = setup->retransmissions_count;
      /* clear Arbitration and Transaction Done interrupt flags */
      device->regptr->sts = I2C_STS_AFI | I2C_STS_TDI;
      /* clear transmitted & received byte counter */
      setup->tx_count = 0;
      setup->rx_count = 0;
      /* set the state indicator */
      txrx_state = 0;
      /* soft reset */
      device->regptr->ctl = I2C_CTL_SOFT_RESET;
      /* self cleared */
      while (device->regptr->ctl & I2C_CTL_SOFT_RESET);
      /* load slave address */
      load_slave_address(devid, setup->addr_mode,
                         setup->sl_addr, I2C_M_WRITE);
      /* en TxFIFO not full,M TxDataR,Tx noACK,Tx ArbF,Tx Done Ints */
      device->regptr->ctl = I2C_CTL_TFFIE | I2C_CTL_DRMIE
                            | I2C_CTL_NAIE | I2C_CTL_AFIE | I2C_CTL_TDIE;
    }
    else
    {
      /* update status */
      setup->status |=
        ((device->regptr->sts & ((I2C_STS_AFI | I2C_STS_NAI)) << 8) |
         I2C_SETUP_STATUS_DONE);
      /* Disable I2C interrupt in the interrupt controller */
      disable_i2c_irq_int(devid);
      /* set txrx state for a new transfer */
      txrx_state = 0;
    }
  }
  /* was a STOP generated? */
  else if ((device->regptr->sts & I2C_STS_TDI) != 0)
  {
    /* clear the TDI bit */
    device->regptr->sts |= I2C_STS_TDI;
    /* update status */
    setup->status |= I2C_SETUP_STATUS_DONE;
    /* Disable I2C interrupt in the interrupt controller */
    disable_i2c_irq_int(devid);
    /* set txrx state for a new transfer */
    txrx_state = 0;
  }
  /* transfer triggered interrupt */
  else
  {
    switch (txrx_state)
    {
        /* transmitting data */
      case 0:
        length  = setup->tx_length;
        count   = setup->tx_count;
        while ((length != count) &&
               ((device->regptr->sts & I2C_STS_TFF) == 0))
        {
          device->regptr->fifo = (setup->tx_data)[count];
          count++;
        }
        setup->tx_count = count;
        /* have all data been sent? */
        if (count == length)
        {
          /* switch to receiving data */
          txrx_state = 1;
          setup->tx_count = 0;
          /* en M Tx Data Req, Tx no ACK, Tx Arb Fail, Tx Done Ints */
          device->regptr->ctl = I2C_CTL_DRMIE | I2C_CTL_NAIE |
                                I2C_CTL_AFIE | I2C_CTL_TDIE;
        }
        break;
        /* receiving data */
      default:
        /* is repeated START + slave address + READ needed? */
        if (setup->tx_count == 0)
        {
          if (setup->addr_mode == ADDR7BIT)
          {
            device->regptr->fifo =
              I2C_TXFF_START_CND | (setup->sl_addr << 1) | I2C_M_READ;
          }
          else
          {
            device->regptr->fifo = I2C_TXFF_START_CND | 0xF0 |
                                   ((setup->sl_addr & 0x30) >> 7) | I2C_M_READ;
          }
          /* en RxDt Av,RxFIFO Fl,MTx DtR,Tx noACK,Tx ArbF,TxDn Ints */
          device->regptr->ctl = I2C_CTL_DAIE | I2C_CTL_RFFIE |
                                I2C_CTL_DRMIE | I2C_CTL_NAIE | I2C_CTL_AFIE | I2C_CTL_TDIE;
          /* write a dummy byte to trigger actual data transfer */
          setup->tx_count = 1;
          setup->rx_count = 0;
          if (setup->rx_length == setup->tx_count)
          {
            /* If rx_length is 1, dummy + STOP on TX FIFO */
            device->regptr->fifo = I2C_TXFF_STOP_CND | 0xAA;
          }
          else
          {
            device->regptr->fifo = 0xAA;
          }
        }
        else
        {
          length  = setup->rx_length;
          count   = setup->rx_count;
          while ((length != count) &&
                 ((device->regptr->sts & I2C_STS_RFE) == 0))
          {
            (setup->rx_data)[count] = device->regptr->fifo;
            count++;
          }
          setup->rx_count = count;
          /* have all data been received? */
          if (count == length)
          {
            /* enable Tx no ACK, Tx Arbitr Fail, Tx Done Ints */
            device->regptr->ctl = I2C_CTL_NAIE |
                                  I2C_CTL_AFIE | I2C_CTL_TDIE;
          }
          else
          {
            // not all data received, fill the Tx FIFO with more dummies
            while ((setup->tx_count != length) &&
                   ((device->regptr->sts & I2C_STS_TFF) == 0))
            {
              if (((setup->tx_count) + 1) == length)
              {
                device->regptr->fifo = I2C_TXFF_STOP_CND | 0xAA;
              }
              else
              {
                device->regptr->fifo = 0xAA;
              }
              setup->tx_count++;
            }
          }
        }
        break;
    }
  }
  return;
}

/***********************************************************************
 * I2C slave transmitter interrupt handler
 **********************************************************************/
void i2c_stx_handler(INT_32 devid)
{
  UNS_32 length, count;
  I2C_CFG_T * device;
  I2C_STX_SETUP_T * setup;

